app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def show
    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 7 LIMIT 1
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Traditional', '2011-07-15 15:38:54', '2011-07-15 15:38:54')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 7 LIMIT 1
---
  def update
    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 3
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy