app/controllers/places_controller.rb

  def show
    @place = Place.find(params[:id])
---
SELECT `places`.* FROM `places` WHERE `places`.`id` = 1 LIMIT 1

  def edit
    if admin?
      @place = Place.find(params[:id])
---
SELECT `places`.* FROM `places` WHERE `places`.`id` = 1 AND (`places`.user_id = 1) ORDER BY published_at DESC, title ASC LIMIT 1

  def create
    @place = current_user.places.new(params[:place])

    respond_to do |format|
      if @place.save
---
INSERT INTO `places` (`longitude`, `photo_updated_at`, `desc`, `phone`, `updated_at`, `title`, `address`, `photo_file_name`, `latitude`, `created_at`, `rating`, `photo_file_size`, `photo_content_type`, `published_at`, `user_id`, `category_id`) VALUES (110.39538860321, '2011-07-15 18:14:51', 'bebek goreng adalah makanan khas indonesia yang sampai saat ini masih dapat dinikmati di yogya.', '0274-234-232', '2011-07-15 18:14:52', 'Bebek Goreng', 'Jl. Affandi no. 4, Yogyakarta', 'Photo on 2011-06-30 at 14.37.jpg', -7.75985267453881, '2011-07-15 18:14:52', NULL, 76012, 'image/jpeg', NULL, 1, 1)

  def update
    @place = current_user.places.find(params[:id])

    respond_to do |format|
      if @place.update_attributes(params[:place])
---
SELECT `places`.* FROM `places` WHERE `places`.`id` = 2 AND (`places`.user_id = 1) ORDER BY published_at DESC, title ASC LIMIT 1
UPDATE `places` SET `updated_at` = '2011-07-15 20:42:08', `photo_file_size` = 82220, `photo_updated_at` = '2011-07-15 20:42:08', `photo_file_name` = 'Photo on 2011-07-02 at 12.34.jpg' WHERE `places`.`id` = 2