app/controllers/users_controller.rb

INSERT INTO `users` (`level`, `created_at`, `email`, `updated_at`, `hashed_password`) VALUES (1, '2011-09-14 13:24:08', 'gojeg@socialblogr.com', '2011-09-14 13:24:08', 'b49b0b7881cc25d4aa89a7d0f1193b0648e9244f')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `updated_at` = '2011-09-14 13:54:07', `level` = 0, `hashed_password` = '921b737dd4a6788cce84328dba6ba3901ff600b2' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 3
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy